In [1]:
'''
In this project, I will use the results from my LinkedIn job postings web scraper project which you can find in this 
repository https://github.com/ayanwu98/LinkedIn-Jobs-Web-Scraper-Project and perform data cleaning with Pandas and 
after the data has been cleaned up, I will perform some data explotarion to extract interesting information regarding the 
Data Science job market.

'''

# We first import the necessary libraries which are pandas and sqlite3 

import pandas as pd
import sqlite3 as sql

In [2]:
# We create a Pandas Dataframe from the results obtained in the web scraping project

df = pd.read_csv('/content/linkedinwebscraper.csv')

In [3]:
# We check the general information about our data frame. We see that there are no null values, so 
# we will not need to fill or drop rows with null values

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 900 entries, 0 to 899
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Company           900 non-null    object
 1   Job_Title         900 non-null    object
 2   Location          900 non-null    object
 3   Seniority_level   900 non-null    object
 4   Python            900 non-null    bool
 5   SQL               900 non-null    bool
 6   R                 900 non-null    bool
 7   Excel             900 non-null    bool
 8   Tableau           900 non-null    bool
 9   Power_BI          900 non-null    bool
 10  Machine_Learning  900 non-null    bool
dtypes: bool(7), object(4)
memory usage: 34.4+ KB

In [4]:
# Now, we will first explore job locations
# We see that the majority of jobs are located in the cities of Toronto, Vancouver, and Montreal.
df['Location'].value_counts()

Toronto, Ontario, Canada                 267
Vancouver, British Columbia, Canada      116
Montreal, Quebec, Canada                 105
Canada                                    47
Ottawa, Ontario, Canada                   40
                                        ...
Surrey, British Columbia, Canada           1
Peterborough, Ontario, Canada              1
Lethbridge, Alberta, Canada                1
Newmarket, Ontario, Canada                 1
St-Jean-Sur-Richelieu, Quebec, Canada      1
Name: Location, Length: 81, dtype: int64

In [5]:
# However, notice that there are 47 jobs in "Canada". Since Toronto is the city with the most jobs
# We will set the jobs in "Canada" to be in "Toronto".
for job in range(len(df)):
  if df['Location'][job] == 'Canada':
    df['Location'][job] = 'Toronto, Ontario, Canada'

<ipython-input-5-b7460c4d1c88>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Location'][job] = 'Toronto, Ontario, Canada'

In [6]:
# Now, while there are 900 jobs, some of them do not appear to be Data Science related. For instance, some of them are software engineering.
# We will then filter out this jobs.

for job in range(len(df)):
  if (('computer vision'.casefold() not in df['Job_Title'][job].casefold()) and ('nlp'.casefold() not in df['Job_Title'][job].casefold()) and ('data'.casefold() not in df['Job_Title'][job].casefold()) and ('Machine learning'.casefold() not in df['Job_Title'][job].casefold())):
    df = df.drop(index=job)
df.reset_index(drop=True)

,Company,Job_Title,Location,Seniority_level,Python,SQL,R,Excel,Tableau,Power_BI,Machine_Learning
0,ISAAC Instruments,Data Scientist,"St-Bruno-de-Montarville, Quebec, Canada",Associate,True,True,False,True,False,False,True
1,FPT Software,Data Scientist,"Toronto, Ontario, Canada",Mid-Senior level,True,True,False,False,False,False,True
2,Ample Insight,Data Scientist - Data Analytics and Infrastruc...,"Toronto, Ontario, Canada",Mid-Senior level,True,True,False,False,False,False,False
3,Zany Consulting Group,Data Scientist,"Toronto, Ontario, Canada",Mid-Senior level,True,False,False,False,False,False,False
4,Outdefine,Data Scientist,"Toronto, Ontario, Canada",Mid-Senior level,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
238,Falcon Smart IT (FalconSmartIT),Big Data Engineer,"Toronto, Ontario, Canada",Entry level,True,True,False,False,False,False,False
239,Binance,Senior Machine Learning Engineer (Anomaly Dete...,"Vancouver, British Columbia, Canada",Mid-Senior level,True,False,False,False,False,False,True
240,Tiger Analytics,Data Engineer - AWS,"Toronto, Ontario, Canada",Associate,True,True,False,True,False,False,True
241,Brex,"Staff Software Engineer, Machine Learning Plat...","Toronto, Ontario, Canada",Mid-Senior level,True,True,False,False,False,False,False
242,Brex,"Staff Software Engineer, Machine Learning Plat...","Toronto, Ontario, Canada",Mid-Senior level,True,True,False,False,False,False,False

In [7]:
# We proceed to drop duplicates

df = df.drop_duplicates()
df = df.reset_index(drop=True)

In [8]:
# We can see now that we end up with 204 unique jobs that are in the field of Data Science.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 204 entries, 0 to 203
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Company           204 non-null    object
 1   Job_Title         204 non-null    object
 2   Location          204 non-null    object
 3   Seniority_level   204 non-null    object
 4   Python            204 non-null    bool
 5   SQL               204 non-null    bool
 6   R                 204 non-null    bool
 7   Excel             204 non-null    bool
 8   Tableau           204 non-null    bool
 9   Power_BI          204 non-null    bool
 10  Machine_Learning  204 non-null    bool
dtypes: bool(7), object(4)
memory usage: 7.9+ KB

In [9]:
# Now we create an csv file with the clean data
df.to_csv('linkedin_jobs_cleaned.csv', index=False)

In [10]:
# We will now proceed to perform data explotarion with SQL. 
# We will perform SQL queries in Python using the sqlite3 library.

# We first create a database named 'data_jobs'
conn = sql.connect('data_jobs.db')
c = conn.cursor()

# Now we create a table named jobs with the same columns.
c.execute("CREATE TABLE jobs(Company,Job_Title, Location, Seniority_level, Python, SQL, R , Excel, Tableau, Power_BI, Machine_Learning)")
jobs = pd.read_csv('/content/linkedin_jobs_cleaned.csv')
jobs.to_sql('jobs', conn, if_exists='append', index= False)

204

In [11]:
# As a first interesting query, we will see how many jobs there are that only require Excel and one of the BI tools.

# Now we select the jobs that are entry level and require excel and tableau or power BI skills.
# Not surprisingly, there is only one job. 

c.execute('''SELECT company, job_title
             FROM jobs
             WHERE (Seniority_level like '%entry%' AND (Excel AND tableau = TRUE) AND (Python AND R AND POWER_BI AND MACHINE_LEARNING = FALSE))
             OR (Seniority_level like '%entry%' AND (Excel AND power_BI = TRUE) AND (Python AND R AND tableau AND MACHINE_LEARNING = FALSE))
''')
c.fetchall()

[('Mier Human Capital', 'Data Scientist')]

In [12]:
# Now, we will extract the amount of jobs that require each skill
# We use a for loop to extract the amount of jobs requiring each individual skill
# We first create a list with the names of the skills

skills = ['Python', 'SQL', 'R' , 'Excel', 'Tableau', 'Power_BI', 'Machine_Learning']

for skill in range(len(skills)):
  c.execute('''SELECT count(company)
                FROM jobs
                WHERE {} = TRUE
  '''.format(skills[skill]))
  print(f'''
  Skill: {skills[skill]}    
  Number of jobs: {str(c.fetchall()[0]).replace('(','').replace(')','').replace(',','')}
  ''')

  Skill: Python
  Number of jobs: 160


  Skill: SQL
  Number of jobs: 104


  Skill: R
  Number of jobs: 15


  Skill: Excel
  Number of jobs: 85


  Skill: Tableau
  Number of jobs: 33


  Skill: Power_BI
  Number of jobs: 13


  Skill: Machine_Learning
  Number of jobs: 136

In [13]:
# We now write a query to see the number of jobs located in the cities of Toronto, Montreal, Vancouver, and Ottawa 
# since these are the cities with the most amount of jobs.

cities = ['Toronto', 'Montreal','Vancouver', 'Ottawa']

for city in range(len(cities)):
  c.execute('''SELECT count(company)
                FROM jobs
                WHERE location like '%{}%'
  '''.format(cities[city]))
  print(f'''
  City: {cities[city]}    
  Number of jobs: {str(c.fetchall()[0]).replace('(','').replace(')','').replace(',','')}
  ''')

  City: Toronto
  Number of jobs: 92


  City: Montreal
  Number of jobs: 23


  City: Vancouver
  Number of jobs: 32


  City: Ottawa
  Number of jobs: 6

In [14]:
""" We now write a query to see the number of jobs located in the cities of Toronto, Montreal, and Vancouver.
    But before we can do so, we need to extract a list of the different seniority levels.

    We first perform a SQL query to extract a list of the different seniority levels.
    Then, we wil extract a list containing only the unique seniority levels.

    Finally, we will run a SQL query to compute the number of jobs for each seniority level.
"""

# Query to extract a list of seniority levels
c.execute('''SELECT seniority_level
                FROM jobs
''')
seniority_levels = c.fetchall()

# We get a list of unique seniority levels 
seniority_levels_set = set(seniority_levels)
unique_seniority_levels = (list(seniority_levels_set))

# For loop to clean our list 
for level in range(len(unique_seniority_levels)):
  unique_seniority_levels[level] = str(unique_seniority_levels[level]).replace('(','').replace(')','').replace(',','').replace("'",'')

# SQL query to compute number of jobs per level
for level in range(len(unique_seniority_levels)):
  c.execute('''SELECT count(company)
                FROM jobs
                WHERE seniority_level like '%{}%'
  '''.format(unique_seniority_levels[level]))
  print(f'''
  Seniority Level: {unique_seniority_levels[level]}    
  Number of jobs: {str(c.fetchall()[0]).replace('(','').replace(')','').replace(',','')}
  ''')

  Seniority Level: Entry level
  Number of jobs: 78


  Seniority Level: Associate
  Number of jobs: 7


  Seniority Level: Not Applicable
  Number of jobs: 40


  Seniority Level: Mid-Senior level
  Number of jobs: 72


  Seniority Level: Full-time
  Number of jobs: 5


  Seniority Level: Contract
  Number of jobs: 1


  Seniority Level: Internship
  Number of jobs: 1